GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_rcu.h
/* RCU_AHBEN */
#define RCU_AHBEN_DMA0EN                BIT(0)                          /*!< DMA0 clock enable */
#define RCU_AHBEN_DMA1EN                BIT(1)                          /*!< DMA1 clock enable */
#define RCU_AHBEN_SRAMSPEN              BIT(2)                          /*!< SRAM clock enable when sleep mode */
#define RCU_AHBEN_FMCSPEN               BIT(4)                          /*!< FMC clock enable when sleep mode */
#define RCU_AHBEN_CRCEN                 BIT(6)                          /*!< CRC clock enable */
#define RCU_AHBEN_EXMCEN                BIT(8)                          /*!< EXMC clock enable */
#define RCU_AHBEN_USBHSEN               BIT(12)                         /*!< USBHS clock enable */
#define RCU_AHBEN_ULPIEN                BIT(13)                         /*!< ULPI clock enable */
#define RCU_AHBEN_TMUEN                 BIT(30)                         /*!< TMU clock enable */
#define RCU_AHBEN_ENETEN                BIT(14)                         /*!< ENET clock enable */
#define RCU_AHBEN_ENETTXEN              BIT(15)                         /*!< Ethernet TX clock enable */
#define RCU_AHBEN_ENETRXEN              BIT(16)                         /*!< Ethernet RX clock enable */
#define RCU_AHBEN_SQPIEN                BIT(31)                         /*!< SQPI clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_AFEN                 BIT(0)                          /*!< alternate function IO clock enable */
#define RCU_APB2EN_PAEN                 BIT(2)                          /*!< GPIO port A clock enable */
#define RCU_APB2EN_PBEN                 BIT(3)                          /*!< GPIO port B clock enable */
#define RCU_APB2EN_PCEN                 BIT(4)                          /*!< GPIO port C clock enable */
#define RCU_APB2EN_PDEN                 BIT(5)                          /*!< GPIO port D clock enable */
#define RCU_APB2EN_PEEN                 BIT(6)                          /*!< GPIO port E clock enable */
#define RCU_APB2EN_PFEN                 BIT(7)                          /*!< GPIO port F clock enable */
#define RCU_APB2EN_PGEN                 BIT(8)                          /*!< GPIO port G clock enable */
#define RCU_APB2EN_ADC0EN               BIT(9)                          /*!< ADC0 clock enable */
#define RCU_APB2EN_ADC1EN               BIT(10)                         /*!< ADC1 clock enable */
#define RCU_APB2EN_TIMER0EN             BIT(11)                         /*!< TIMER0 clock enable */
#define RCU_APB2EN_SPI0EN               BIT(12)                         /*!< SPI0 clock enable */
#define RCU_APB2EN_TIMER7EN             BIT(13)                         /*!< TIMER7 clock enable */
#define RCU_APB2EN_USART0EN             BIT(14)                         /*!< USART0 clock enable */
#define RCU_APB2EN_TIMER8EN             BIT(19)                         /*!< TIMER8 clock enable */
#define RCU_APB2EN_TIMER9EN             BIT(20)                         /*!< TIMER9 clock enable */
#define RCU_APB2EN_TIMER10EN            BIT(21)                         /*!< TIMER10 clock enable */
#define RCU_APB2EN_USART5EN             BIT(28)                         /*!< USART5 clock enable */
#define RCU_APB2EN_SHRTIMEREN           BIT(29)                         /*!< SHRTIMER clock enable */
#define RCU_APB2EN_CMPEN                BIT(31)                         /*!< CMP clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_TIMER1EN             BIT(0)                          /*!< TIMER1 clock enable */
#define RCU_APB1EN_TIMER2EN             BIT(1)                          /*!< TIMER2 clock enable */
#define RCU_APB1EN_TIMER3EN             BIT(2)                          /*!< TIMER3 clock enable */
#define RCU_APB1EN_TIMER4EN             BIT(3)                          /*!< TIMER4 clock enable */
#define RCU_APB1EN_TIMER5EN             BIT(4)                          /*!< TIMER5 clock enable */
#define RCU_APB1EN_TIMER6EN             BIT(5)                          /*!< TIMER6 clock enable */
#define RCU_APB1EN_TIMER11EN            BIT(6)                          /*!< TIMER11 clock enable */
#define RCU_APB1EN_TIMER12EN            BIT(7)                          /*!< TIMER12 clock enable */
#define RCU_APB1EN_TIMER13EN            BIT(8)                          /*!< TIMER13 clock enable */
#define RCU_APB1EN_WWDGTEN              BIT(11)                         /*!< WWDGT clock enable */
#define RCU_APB1EN_SPI1EN               BIT(14)                         /*!< SPI1 clock enable */
#define RCU_APB1EN_SPI2EN               BIT(15)                         /*!< SPI2 clock enable */
#define RCU_APB1EN_USART1EN             BIT(17)                         /*!< USART1 clock enable */
#define RCU_APB1EN_USART2EN             BIT(18)                         /*!< USART2 clock enable */
#define RCU_APB1EN_UART3EN              BIT(19)                         /*!< UART3 clock enable */
#define RCU_APB1EN_UART4EN              BIT(20)                         /*!< UART4 clock enable */
#define RCU_APB1EN_I2C0EN               BIT(21)                         /*!< I2C0 clock enable */
#define RCU_APB1EN_I2C1EN               BIT(22)                         /*!< I2C1 clock enable */
#define RCU_APB1EN_I2C2EN               BIT(24)                         /*!< I2C2 clock enable */
#define RCU_APB1EN_CAN0EN               BIT(25)                         /*!< CAN0 clock enable */
#define RCU_APB1EN_CAN1EN               BIT(26)                         /*!< CAN1 clock enable */
#define RCU_APB1EN_BKPIEN               BIT(27)                         /*!< backup interface clock enable */
#define RCU_APB1EN_PMUEN                BIT(28)                         /*!< PMU clock enable */
#define RCU_APB1EN_DACEN                BIT(29)                         /*!< DAC clock enable */

/* RCU_BDCTL */
#define RCU_BDCTL_LXTALEN               BIT(0)                          /*!< LXTAL enable */
#define RCU_BDCTL_LXTALSTB              BIT(1)                          /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALBPS              BIT(2)                          /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALDRI              BITS(3,4)                       /*!< LXTAL drive capability */
#define RCU_BDCTL_RTCSRC                BITS(8,9)                       /*!< RTC clock entry selection */
#define RCU_BDCTL_RTCEN                 BIT(15)                         /*!< RTC clock enable */
#define RCU_BDCTL_BKPRST                BIT(16)                         /*!< backup domain reset */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC40KEN             BIT(0)                          /*!< IRC40K enable */
#define RCU_RSTSCK_IRC40KSTB            BIT(1)                          /*!< IRC40K stabilization flag */
#define RCU_RSTSCK_RSTFC                BIT(24)                         /*!< reset flag clear */
#define RCU_RSTSCK_EPRSTF               BIT(26)                         /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF              BIT(27)                         /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF               BIT(28)                         /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF            BIT(29)                         /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF            BIT(30)                         /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF               BIT(31)                         /*!< low-power reset flag */

