GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Include/gd32a508_rcu.h
/* RCU_AHBRST */
#define RCU_AHBRST_USBHSRST             BIT(12)                         /*!< USBHS reset */
#define RCU_AHBRST_TMURST               BIT(30)                         /*!< TMU reset */
#define RCU_AHBRST_ENETRST              BIT(14)                         /*!< ENET reset */
#define RCU_AHBRST_SQPIRST              BIT(31)                         /*!< SQPI reset */

/* RCU_CFG1 */
#define RCU_CFG1_PREDV0                 BITS(0,3)                       /*!< PREDV0 division factor */
#define RCU_CFG1_PREDV1                 BITS(4,7)                       /*!< PREDV1 division factor */
#define RCU_CFG1_PLL1MF                 BITS(8,11)                      /*!< PLL1 clock multiplication factor */
#define RCU_CFG1_PLL2MF                 BITS(12,15)                     /*!< PLL2 clock multiplication factor */
#define RCU_CFG1_PREDV0SEL              BIT(16)                         /*!< PREDV0 input clock source selection */
#define RCU_CFG1_I2S1SEL                BIT(17)                         /*!< I2S1 clock source selection */
#define RCU_CFG1_I2S2SEL                BIT(18)                         /*!< I2S2 clock source selection  */
#define RCU_CFG1_PLL2MF_5               BIT(28)                         /*!< bit 6 of PLL2MF */
#define RCU_CFG1_PLL2MF_4               BIT(31)                         /*!< bit 5 of PLL2MF */
#define RCU_CFG1_SHRTIMERSEL            BIT(19)                         /*!< SHRTIMER clock source selection  */
#define RCU_CFG1_ADCPSC_3               BIT(29)                         /*!< bit 4 of ADCPSC */
#define RCU_CFG1_PLLPRESEL              BIT(30)                         /*!< PLL clock source selection */

/* RCU_DSV */
#define RCU_DSV_DSLPVS                  BITS(0,2)                       /*!< deep-sleep mode voltage select */

/* RCU_ADDCTL */
#define RCU_ADDCTL_CK48MSEL             BITS(0,1)                       /*!< 48MHz clock selection */
#define RCU_ADDCTL_USBHSSEL             BIT(2)                          /*!< USBHS clock selection */
#define RCU_ADDCTL_USBHSDV              BITS(3,5)                       /*!< USBHS clock divider factor */
#define RCU_ADDCTL_USBSWEN              BIT(6)                          /*!< USB clock source selection enable */
#define RCU_ADDCTL_PLLUSBEN             BIT(14)                         /*!< PLLUSB enable */
#define RCU_ADDCTL_PLLUSBSTB            BIT(15)                         /*!< PLLUSB clock stabilization flag */
#define RCU_ADDCTL_IRC48MEN             BIT(16)                         /*!< internal 48MHz RC oscillator enable */
#define RCU_ADDCTL_IRC48MSTB            BIT(17)                         /*!< internal 48MHz RC oscillator clock stabilization flag */
#define RCU_ADDCTL_IRC48MCAL            BITS(24,31)                     /*!< internal 48MHz RC oscillator calibration value register */

/* RCU_ADDCFG */
#define RCU_ADDCFG_PLLUSBPREDV          BITS(0,3)                       /*!< PLLUSBPREDV division factor */
#define RCU_ADDCFG_PLLUSBPRESEL         BIT(16)                         /*!< PLLUSB clock source preselection */
#define RCU_ADDCFG_PLLUSBPREDVSEL       BIT(17)                         /*!< PLLUSBPREDV input Clock Source Selection */
#define RCU_ADDCFG_PLLUSBMF             BITS(18,24)                     /*!< The PLLUSB clock multiplication factor */

/* RCU_ADDINT */
#define RCU_ADDINT_IRC48MSTBIF          BIT(6)                          /*!< IRC48M stabilization interrupt flag */
#define RCU_ADDINT_IRC48MSTBIE          BIT(14)                         /*!< internal 48 MHz RC oscillator stabilization interrupt enable */
#define RCU_ADDINT_IRC48MSTBIC          BIT(22)                         /*!< internal 48 MHz RC oscillator stabilization interrupt clear */
#define RCU_ADDINT_PLLUSBSTBIF          BIT(7)                          /*!< PLLUSB stabilization interrupt flag */
#define RCU_ADDINT_PLLUSBSTBIE          BIT(15)                         /*!< PLLUSB stabilization interrupt enable */
#define RCU_ADDINT_PLLUSBSTBIC          BIT(23)                         /*!< PLLUSB stabilization interrupt clear */

/* RCU_PLLSSCTL */
#define RCU_PLLSSCTL_MODCNT             BITS(0,12)                      /*!< these bits configure PLL spread spectrum modulation 
                                                                             profile amplitude and frequency. the following criteria 
                                                                             must be met: MODSTEP*MODCNT=215-1 */
#define RCU_PLLSSCTL_MODSTEP            BITS(13,27)                     /*!< these bits configure PLL spread spectrum modulation 
                                                                             profile amplitude and frequency. the following criteria 
                                                                             must be met: MODSTEP*MODCNT=215-1 */
#define RCU_PLLSSCTL_SS_TYPE            BIT(30)                         /*!< PLL spread spectrum modulation type select */
#define RCU_PLLSSCTL_SSCGON             BIT(31)                         /*!< PLL spread spectrum modulation enable */

/* RCU_CFG2 */
#define RCU_CFG2_USART5SEL              BITS(0,1)                       /*!< USART5 Clock Source Selection */
#define RCU_CFG2_I2C2SEL                BITS(4,5)                       /*!< I2C2 Clock Source Selection */

/* RCU_ADDAPB1RST */
#define RCU_ADDAPB1RST_CTCRST           BIT(27)                         /*!< CTC reset */
#define RCU_ADDAPB1RST_CAN2RST          BIT(31)                         /*!< CAN2 reset */

/* RCU_ADDAPB1EN */
#define RCU_ADDAPB1EN_CTCEN             BIT(27)                         /*!< CTC clock enable */
#define RCU_ADDAPB1EN_CAN2EN            BIT(31)                         /*!< CAN2 clock enable */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)                 (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x1FU)

/* register offset */
/* peripherals enable */
#define AHBEN_REG_OFFSET                0x14U                     /*!< AHB enable register offset */
#define APB1EN_REG_OFFSET               0x1CU                     /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               0x18U                     /*!< APB2 enable register offset */
#define ADD_APB1EN_REG_OFFSET           0xE4U                     /*!< APB1 additional enable register offset */

